app/controllers/todos_controller.rb

SELECT * FROM "todos"
---
  def index
    @todos = Todo.all

INSERT INTO "todos" ("created_at", "title", "updated_at") VALUES('2009-10-20 16:45:40', 'First TODO', '2009-10-20 16:45:40')
---
  def create
    @todo = Todo.new(params[:todo])

    if @todo.save

DELETE FROM "todos" WHERE "id" = 1
---
  def destroy
    @todo = Todo.destroy(params[:id])